# ColorOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorOptions Class
Members See Also
---
A class providing access to color settings which affect the colors applied to specific views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class ColorOptions : IDisposable
```

Visual Basic
---
```text
Public Class ColorOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ColorOptions : IDisposable
```

# Remarks
ColorOptions are managed and stored along with other global application options and thus impact the application as a whole.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ColorOptions
# See Also
ColorOptions Members
Autodesk.Revit.DB Namespace